<a href="https://colab.research.google.com/github/Odionrite/University_Database_Mock_Project/blob/main/WU_Mock_Database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**ASSIGNMENT**

Creation of a mock database for Wrexhman University, Wrexham.
The Assignment will consider creation of five (5) major tables from which the join function would be leverage to create other virtual tables as need arises.

In [39]:
!pip -q install ipython-sql sqlalchemy

In [41]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [42]:
%%sql

sqlite:///WU_Mock.db

In [43]:
%%sql

-- Create DEPARTMENT table
DROP TABLE IF EXISTS DEPARTMENT;
CREATE TABLE DEPARTMENT (
    dept_id INTEGER PRIMARY KEY AUTOINCREMENT,
    dept_name VARCHAR(100) NOT NULL UNIQUE,
    dept_address VARCHAR(100) NOT NULL
  );

-- Insert values in Department table
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Data Science and Big Data Analytics', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Computer Science', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Information Technology', 'North Wales Science Park, Chester Road, LL13 9UF');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Artificial Intelligence', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Software Engineering', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Cyber Security', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Digital Media', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Cloud Computing and DevOps', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Robotics and Embedded Systems', 'North Wales Science Park, Chester Road, LL13 9UF');
INSERT INTO DEPARTMENT (dept_name, dept_address) VALUES ('Department of Digital Forensics', 'Enterprise Engineering & Optics Centre, St Asaph, LL17 0JD');

 * sqlite:///WU_Mock.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [44]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [45]:
%config SqlMagic.displaylimit = None

In [47]:
%%sql

SELECT * FROM DEPARTMENT;

 * sqlite:///WU_Mock.db
Done.

[(1, 'Department of Data Science and Big Data Analytics', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW'),
 (2, 'Department of Computer Science', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW'),
 (3, 'Department of Information Technology', 'North Wales Science Park, Chester Road, LL13 9UF'),
 (4, 'Department of Artificial Intelligence', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW'),
 (5, 'Department of Software Engineering', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW'),
 (6, 'Department of Cyber Security', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW'),
 (7, 'Department of Digital Media', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW'),
 (8, 'Department of Cloud Computing and DevOps', 'Plas Coch Campus, Mold Road, Wrexham, LL11 2AW'),
 (9, 'Department of Robotics and Embedded Systems', 'North Wales Science Park, Chester Road, LL13 9UF'),
 (10, 'Department of Digital Forensics', 'Enterprise Engineering & Optics Centre, St Asaph, LL17 0JD')]

In [48]:
%%sql

DROP TABLE IF EXISTS LECTURERS;

--Create Lecturers table
CREATE TABLE LECTURERS (
  lecturer_id INTEGER PRIMARY KEY AUTOINCREMENT,
  staff_no VARCHAR(10) NOT NULL UNIQUE,
  first_name VARCHAR(50) NOT NULL,
  last_name VARCHAR(50) NOT NULL,
  age INTEGER NOT NULL,
  email VARCHAR(100) NOT NULL UNIQUE,
  phone_number VARCHAR(20) NOT NULL,
  nationality VARCHAR(50) NOT NULL,
  gender VARCHAR(10) NOT NULL,
  dept_id INTEGER NOT NULL,
  FOREIGN KEY(dept_id) REFERENCES DEPARTMENT(dept_id)
);

-- Insert values into LECTURERS table
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS250', 'Molly', 'Martin', 35, 'MollyGMartin@armyspy.com', '07958931543', 'American', 'Male', 1);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS149', 'David', 'Guzman', 58, 'DavidGGuzman@teleworm.us', '07911529637', 'Britain', 'Male', 2);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS206', 'Ginikanwa', 'Obinna', 44, 'GinikanwaObinna@armyspy.com', '07873913438', 'Nigerian', 'Male', 3);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS222', 'Nicholas', 'Mistry', 44, 'NicholasMistry@teleworm.us', '07903388476', 'Britain', 'Female', 4);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS200', 'Astrid', 'Jespersen', 40, 'AstridSJespersen@dayrep.com', '07726389958', 'Britian', 'Female', 5);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS189', 'Veli-Matti', 'Kauniainen', 44, 'Veli-MattiKauniainen@armyspy.com', '07966688639', 'Italian', 'Male', 6);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS199', 'Gigliola', 'Mancini', 49, 'GigliolaMancini@teleworm.us', '07889987636', 'Italian', 'Female', 7);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS278', 'Nathan', 'Vasiliev', 53, 'NathanVasiliev@jourrapide.com', '07988447930', 'Russian', 'Male', 8);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS289', 'Danyl', 'Maclean', 41, 'DanylMaclean@dayrep.com', '07056815304', 'Scottish', 'Male', 9);
INSERT INTO LECTURERS (staff_no, first_name, last_name, age, email, phone_number, nationality, gender, dept_id) VALUES ('WUS253', 'Benedykt', 'Kowalczyk', 60, 'BenedyktKowalczyk@armyspy.com', '07731735979', 'Polish', 'Male', 10 )

 * sqlite:///WU_Mock.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [49]:
%%sql

SELECT * FROM LECTURERS;

 * sqlite:///WU_Mock.db
Done.

[(1, 'WUS250', 'Molly', 'Martin', 35, 'MollyGMartin@armyspy.com', '07958931543', 'American', 'Male', 1),
 (2, 'WUS149', 'David', 'Guzman', 58, 'DavidGGuzman@teleworm.us', '07911529637', 'Britain', 'Male', 2),
 (3, 'WUS206', 'Ginikanwa', 'Obinna', 44, 'GinikanwaObinna@armyspy.com', '07873913438', 'Nigerian', 'Male', 3),
 (4, 'WUS222', 'Nicholas', 'Mistry', 44, 'NicholasMistry@teleworm.us', '07903388476', 'Britain', 'Female', 4),
 (5, 'WUS200', 'Astrid', 'Jespersen', 40, 'AstridSJespersen@dayrep.com', '07726389958', 'Britian', 'Female', 5),
 (6, 'WUS189', 'Veli-Matti', 'Kauniainen', 44, 'Veli-MattiKauniainen@armyspy.com', '07966688639', 'Italian', 'Male', 6),
 (7, 'WUS199', 'Gigliola', 'Mancini', 49, 'GigliolaMancini@teleworm.us', '07889987636', 'Italian', 'Female', 7),
 (8, 'WUS278', 'Nathan', 'Vasiliev', 53, 'NathanVasiliev@jourrapide.com', '07988447930', 'Russian', 'Male', 8),
 (9, 'WUS289', 'Danyl', 'Maclean', 41, 'DanylMaclean@dayrep.com', '07056815304', 'Scottish', 'Male', 9),
 (10, 'WUS253', 'Benedykt', 'Kowalczyk', 60, 'BenedyktKowalczyk@armyspy.com', '07731735979', 'Polish', 'Male', 10)]

In [50]:
%%sql
SELECT l.staff_no, l.first_name, l.last_name, d.dept_name
FROM LECTURERS l
JOIN DEPARTMENT d ON l.dept_id = d.dept_id;

 * sqlite:///WU_Mock.db
Done.

[('WUS250', 'Molly', 'Martin', 'Department of Data Science and Big Data Analytics'),
 ('WUS149', 'David', 'Guzman', 'Department of Computer Science'),
 ('WUS206', 'Ginikanwa', 'Obinna', 'Department of Information Technology'),
 ('WUS222', 'Nicholas', 'Mistry', 'Department of Artificial Intelligence'),
 ('WUS200', 'Astrid', 'Jespersen', 'Department of Software Engineering'),
 ('WUS189', 'Veli-Matti', 'Kauniainen', 'Department of Cyber Security'),
 ('WUS199', 'Gigliola', 'Mancini', 'Department of Digital Media'),
 ('WUS278', 'Nathan', 'Vasiliev', 'Department of Cloud Computing and DevOps'),
 ('WUS289', 'Danyl', 'Maclean', 'Department of Robotics and Embedded Systems'),
 ('WUS253', 'Benedykt', 'Kowalczyk', 'Department of Digital Forensics')]

In [51]:
%%sql

-- Let's create the Courses table
DROP TABLE IF EXISTS COURSES;

-- Create Courses table
CREATE TABLE COURSES (
  course_id INTEGER PRIMARY KEY AUTOINCREMENT,
  course_code VARCHAR(10) UNIQUE NOT NULL,
  course_title VARCHAR(100) NOT NULL,
  credits INTEGER CHECK (credits >= 0),
  dept_id INTEGER NOT NULL,
  FOREIGN KEY(dept_id) REFERENCES DEPARTMENT(dept_id)
);

-- Insert values into COURSES table
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('COM736', 'Database Systems and Data Analytics', 20, 1);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('COM763', 'Advanced Machine Learning', 20, 1);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('COM762', 'Advanced Data Analysis and Visualisation', 20, 1);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('CSC705', 'Cyber Security and Digital Forensics', 20, 2);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('DI704', 'Human–Computer Interaction and UX Design', 20, 3);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('CSC709', 'Intelligent Agents and Autonomous Systems', 20, 4);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('CSC706', 'Cloud Computing and Distributed Systems', 20, 6);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('SE702', 'Software Architecture and Design', 20, 5);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('SE701', 'Secure Software Development', 20, 6);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('SE705', 'Software Project Management', 20, 5);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('DF701', 'Network Forensics and Incident Response', 20, 10);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('DM701', 'Advanced Media Production', 20, 7);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('DM702', 'Digital Storytelling and Narrative Design', 20, 7);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('DM705', 'Sound Design and Audio Production', 20, 10);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('RES701', 'Automation, Robotics and Control Systems', 20, 9);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('RES704', 'Industrial Automation and PLC Programming', 20, 9);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('CC701', 'Virtualisation and Cloud Computing', 20, 8);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('CC702', 'Distributed Systems and Cloud Platforms', 20, 8);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('CC703', 'Cloud Security and Compliance', 20, 8);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('CC704', 'Cloud Infrastructure and DevOps', 20, 8);
INSERT INTO COURSES (course_code, course_title, credits, dept_id) VALUES ('CC705', 'Cloud Data Management', 20, 8);

 * sqlite:///WU_Mock.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [52]:
%%sql

SELECT *FROM COURSES;

 * sqlite:///WU_Mock.db
Done.

[(1, 'COM736', 'Database Systems and Data Analytics', 20, 1),
 (2, 'COM763', 'Advanced Machine Learning', 20, 1),
 (3, 'COM762', 'Advanced Data Analysis and Visualisation', 20, 1),
 (4, 'CSC705', 'Cyber Security and Digital Forensics', 20, 2),
 (5, 'DI704', 'Human–Computer Interaction and UX Design', 20, 3),
 (6, 'CSC709', 'Intelligent Agents and Autonomous Systems', 20, 4),
 (7, 'CSC706', 'Cloud Computing and Distributed Systems', 20, 6),
 (8, 'SE702', 'Software Architecture and Design', 20, 5),
 (9, 'SE701', 'Secure Software Development', 20, 6),
 (10, 'SE705', 'Software Project Management', 20, 5),
 (11, 'DF701', 'Network Forensics and Incident Response', 20, 10),
 (12, 'DM701', 'Advanced Media Production', 20, 7),
 (13, 'DM702', 'Digital Storytelling and Narrative Design', 20, 7),
 (14, 'DM705', 'Sound Design and Audio Production', 20, 10),
 (15, 'RES701', 'Automation, Robotics and Control Systems', 20, 9),
 (16, 'RES704', 'Industrial Automation and PLC Programming', 20, 9),
 (17, 'CC701', 'Virtualisation and Cloud Computing', 20, 8),
 (18, 'CC702', 'Distributed Systems and Cloud Platforms', 20, 8),
 (19, 'CC703', 'Cloud Security and Compliance', 20, 8),
 (20, 'CC704', 'Cloud Infrastructure and DevOps', 20, 8),
 (21, 'CC705', 'Cloud Data Management', 20, 8)]

In [53]:
%%sql

-- Let's view the courses table with department names
SELECT l.staff_no, l.first_name, l.last_name, d.dept_name, c.course_code, c.course_title
FROM LECTURERS l
JOIN DEPARTMENT d ON l.dept_id = d.dept_id
JOIN COURSES c ON d.dept_id = c.dept_id;

 * sqlite:///WU_Mock.db
Done.

[('WUS250', 'Molly', 'Martin', 'Department of Data Science and Big Data Analytics', 'COM736', 'Database Systems and Data Analytics'),
 ('WUS250', 'Molly', 'Martin', 'Department of Data Science and Big Data Analytics', 'COM762', 'Advanced Data Analysis and Visualisation'),
 ('WUS250', 'Molly', 'Martin', 'Department of Data Science and Big Data Analytics', 'COM763', 'Advanced Machine Learning'),
 ('WUS149', 'David', 'Guzman', 'Department of Computer Science', 'CSC705', 'Cyber Security and Digital Forensics'),
 ('WUS206', 'Ginikanwa', 'Obinna', 'Department of Information Technology', 'DI704', 'Human–Computer Interaction and UX Design'),
 ('WUS222', 'Nicholas', 'Mistry', 'Department of Artificial Intelligence', 'CSC709', 'Intelligent Agents and Autonomous Systems'),
 ('WUS200', 'Astrid', 'Jespersen', 'Department of Software Engineering', 'SE702', 'Software Architecture and Design'),
 ('WUS200', 'Astrid', 'Jespersen', 'Department of Software Engineering', 'SE705', 'Software Project Management'),
 ('WUS189', 'Veli-Matti', 'Kauniainen', 'Department of Cyber Security', 'CSC706', 'Cloud Computing and Distributed Systems'),
 ('WUS189', 'Veli-Matti', 'Kauniainen', 'Department of Cyber Security', 'SE701', 'Secure Software Development'),
 ('WUS199', 'Gigliola', 'Mancini', 'Department of Digital Media', 'DM701', 'Advanced Media Production'),
 ('WUS199', 'Gigliola', 'Mancini', 'Department of Digital Media', 'DM702', 'Digital Storytelling and Narrative Design'),
 ('WUS278', 'Nathan', 'Vasiliev', 'Department of Cloud Computing and DevOps', 'CC701', 'Virtualisation and Cloud Computing'),
 ('WUS278', 'Nathan', 'Vasiliev', 'Department of Cloud Computing and DevOps', 'CC702', 'Distributed Systems and Cloud Platforms'),
 ('WUS278', 'Nathan', 'Vasiliev', 'Department of Cloud Computing and DevOps', 'CC703', 'Cloud Security and Compliance'),
 ('WUS278', 'Nathan', 'Vasiliev', 'Department of Cloud Computing and DevOps', 'CC704', 'Cloud Infrastructure and DevOps'),
 ('WUS278', 'Nathan', 'Vasiliev', 'Department of Cloud Computing and DevOps', 'CC705', 'Cloud Data Management'),
 ('WUS289', 'Danyl', 'Maclean', 'Department of Robotics and Embedded Systems', 'RES701', 'Automation, Robotics and Control Systems'),
 ('WUS289', 'Danyl', 'Maclean', 'Department of Robotics and Embedded Systems', 'RES704', 'Industrial Automation and PLC Programming'),
 ('WUS253', 'Benedykt', 'Kowalczyk', 'Department of Digital Forensics', 'DF701', 'Network Forensics and Incident Response'),
 ('WUS253', 'Benedykt', 'Kowalczyk', 'Department of Digital Forensics', 'DM705', 'Sound Design and Audio Production')]

In [54]:
%%sql

-- Let's create STUDENTS table
DROP TABLE IF EXISTS STUDENTS;

CREATE TABLE STUDENTS (
  student_id INTEGER PRIMARY KEY AUTOINCREMENT,
  student_no  VARCHAR(10) NOT NULL UNIQUE,
  first_name VARCHAR(50) NOT NULL,
  last_name VARCHAR(60) NOT NULL,
  dob DATE NOT NULL,
  nino VARCHAR(20) NOT NULL UNIQUE,
  student_address VARCHAR(100) NOT NULL,
  gender VARCHAR(10) NOT NULL,
  nationality VARCHAR(50) NOT NULL,
  email VARCHAR(100) NOT NULL UNIQUE,
  phone_number VARCHAR(20) NOT NULL,
  status TEXT DEFAULT 'Active',
  dept_id INTEGER NOT NULL,
  dept_name VARCHAR(100) NOT NULL,
  FOREIGN KEY(dept_id) REFERENCES DEPARTMENT(dept_id),
  FOREIGN KEY(dept_name) REFERENCES DEPARTMENT(dept_name)
);

-- Insert values into STUDENTS table
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S230', 'Chidimma', 'Chukwuemeka', '1994-04-24', 'BY006230D', '70 Cloch Rd. ST MARY CRAY, BR55HP', 'Male', 'Nigeria', 'ChidimmaChukwuemeka@teleworm.us', '07958704738', 1, 'Department of Data Science and Big Data Analytics');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S251', 'John .E.', 'Amayaa', '1997-10-17', 'GZ964416C', '30 Tonbridge Rd., Conicavel, IV369NY', 'Male', 'American', 'JohnEAmaya@teleworm.us', '07905596238', 1, 'Department of Data Science and Big Data Analytics');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S260', 'Mathias', 'Fried', '1990-02-25', 'OM062616C', '81 Fore St., Tuckingmil, TR143JG', 'Male', 'German', 'MatthiasFried@teleworm.us', '07916629608', 1, 'Department of Data Science and Big Data Analytics');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S281', 'Brigitte', 'Faber', '2000-09-22', 'KE847063C', '45 Union Terrace, Lofthouse, WF34LH', 'Female', 'German', 'BrigitteFaber@teleworm.us', '07964771882', 1, 'Department of Data Science and Big Data Analytics');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S292', 'Ethan', 'Langford', '1992-11-03', 'ZM981476A', '95 St Denys Rd., Portwrinkle, PL115ZJ', 'Male', 'Australian', 'EthanLangford@dayrep.com', '07851201507', 2, 'Department of Computer Science');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S296', 'Sakinah', 'Sahlah Masih', '1996-01-31', 'CP255738B', '86 Peachfield Rd., Chadshunt, CV353XJ', 'Female', 'Arabian', 'SakinahSahlahMasih@armyspy.com', '07883582196', 2, 'Department of Computer Science');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S299', 'Alice Ferreira', 'Costa', '1990-08-20', 'YL995728D', '1 High St., Ash Magna, SY137EF', 'Female', 'Brazilian', 'AliceFerreiraCosta@jourrapide.com', '07931055406', 3, 'Department of Information Technology');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S284', 'Rikke J.', 'Kristoffersen', '1994-09-03', 'ZP148571', '33 St Denys Rd., Biddisham, BS260UX', 'Female', 'Danish', 'RikkeJKristoffersen@jourrapide.com', '07739137395', 4, 'Department of Artificial Intelligence');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S286', 'Mladenka', 'Vuković', '1996-03-19', 'SE593049C', '53 Canterbury Rd., Urlay Nook, TS161QZ', 'Female', 'Croatian', 'MladenkaVukovic@armyspy.com', '07911902574', 5, 'Department of Software Engineering');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S288', 'Zoe', 'Holloway', '2005-06-26', 'ZM055701', '79 Bishopthorpe Rd., Penmorfa, LL496FE', 'Female', 'Britian', 'ZoeHolloway@armyspy.com', '07918638094', 6, 'Department of Cyber Security');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S278', 'ZoeAdam', 'Gardner', '1993-03-13', 'CL687010A', '47 Balsham Rd., Hartest, IP292XW', 'Male', 'Britian', 'AdamGardner@armyspy.com', '07985453946', 7, 'Department of Digital Media');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S208', 'Sebastian', 'Martin', '2005-01-15', 'XT475070A', '93 Graham Rd., Chelsfield, BR68XD', 'Male', 'Scottish', 'SebastianMartin@dayrep.com', '07840685831', 7, 'Department of Digital Media');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S276', 'Itala', 'Marcelo', '1994-04-19', 'OS009671', '86 Farburn Terrace, Little Hougton, NN73YG', 'Female', 'Italian', 'ItalaMarcelo@teleworm.us', '07847640641', 8, 'Department of Cloud Computing and DevOps');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S236', 'Gabriele', 'Russo', '1996-06-08', 'BC703499A', '64 Warren St, West Grinstead, RH130NR', 'Male', 'Italian', 'GabrieleRusso@dayrep.com', '07722531308', 9, 'Department of Robotics and Embedded Systems');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S248', 'Emma', 'Williamson', '2005-12-18', 'EN303754', '67 Cambridge Road, Normanby, DN157AR', 'Female', 'Scottish', 'EmmaWilliamson@teleworm.us', '07880213151', 9, 'Department of Robotics and Embedded Systems');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S233', 'Crispina', 'Bellucci', '1990-09-21', 'JW779645A', '79 Hindhead Rd., Earlish, IV513TR', 'Female', 'Italian', 'CrispinaBellucci@teleworm.us', '07712701410', 10, 'Department of Digital Forensics');
INSERT INTO STUDENTS (student_no, first_name, last_name, dob, nino, student_address, gender, nationality, email, phone_number, dept_id, dept_name) VALUES ('S231', 'Kai', 'Black', '2001-09-26', 'KB054716', '21 Davids Lane, Stutton, IP94PH', 'Male', 'Scottish', 'KaiBlack@jourrapide.com', '07785272163', 10, 'Department of Digital Forensics');

 * sqlite:///WU_Mock.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [55]:
%%sql

SELECT * FROM STUDENTS;

 * sqlite:///WU_Mock.db
Done.

[(1, 'S230', 'Chidimma', 'Chukwuemeka', '1994-04-24', 'BY006230D', '70 Cloch Rd. ST MARY CRAY, BR55HP', 'Male', 'Nigeria', 'ChidimmaChukwuemeka@teleworm.us', '07958704738', 'Active', 1, 'Department of Data Science and Big Data Analytics'),
 (2, 'S251', 'John .E.', 'Amayaa', '1997-10-17', 'GZ964416C', '30 Tonbridge Rd., Conicavel, IV369NY', 'Male', 'American', 'JohnEAmaya@teleworm.us', '07905596238', 'Active', 1, 'Department of Data Science and Big Data Analytics'),
 (3, 'S260', 'Mathias', 'Fried', '1990-02-25', 'OM062616C', '81 Fore St., Tuckingmil, TR143JG', 'Male', 'German', 'MatthiasFried@teleworm.us', '07916629608', 'Active', 1, 'Department of Data Science and Big Data Analytics'),
 (4, 'S281', 'Brigitte', 'Faber', '2000-09-22', 'KE847063C', '45 Union Terrace, Lofthouse, WF34LH', 'Female', 'German', 'BrigitteFaber@teleworm.us', '07964771882', 'Active', 1, 'Department of Data Science and Big Data Analytics'),
 (5, 'S292', 'Ethan', 'Langford', '1992-11-03', 'ZM981476A', '95 St Denys Rd., Portwrinkle, PL115ZJ', 'Male', 'Australian', 'EthanLangford@dayrep.com', '07851201507', 'Active', 2, 'Department of Computer Science'),
 (6, 'S296', 'Sakinah', 'Sahlah Masih', '1996-01-31', 'CP255738B', '86 Peachfield Rd., Chadshunt, CV353XJ', 'Female', 'Arabian', 'SakinahSahlahMasih@armyspy.com', '07883582196', 'Active', 2, 'Department of Computer Science'),
 (7, 'S299', 'Alice Ferreira', 'Costa', '1990-08-20', 'YL995728D', '1 High St., Ash Magna, SY137EF', 'Female', 'Brazilian', 'AliceFerreiraCosta@jourrapide.com', '07931055406', 'Active', 3, 'Department of Information Technology'),
 (8, 'S284', 'Rikke J.', 'Kristoffersen', '1994-09-03', 'ZP148571', '33 St Denys Rd., Biddisham, BS260UX', 'Female', 'Danish', 'RikkeJKristoffersen@jourrapide.com', '07739137395', 'Active', 4, 'Department of Artificial Intelligence'),
 (9, 'S286', 'Mladenka', 'Vuković', '1996-03-19', 'SE593049C', '53 Canterbury Rd., Urlay Nook, TS161QZ', 'Female', 'Croatian', 'MladenkaVukovic@armyspy.com', '07911902574', 'Active', 5, 'Department of Software Engineering'),
 (10, 'S288', 'Zoe', 'Holloway', '2005-06-26', 'ZM055701', '79 Bishopthorpe Rd., Penmorfa, LL496FE', 'Female', 'Britian', 'ZoeHolloway@armyspy.com', '07918638094', 'Active', 6, 'Department of Cyber Security'),
 (11, 'S278', 'ZoeAdam', 'Gardner', '1993-03-13', 'CL687010A', '47 Balsham Rd., Hartest, IP292XW', 'Male', 'Britian', 'AdamGardner@armyspy.com', '07985453946', 'Active', 7, 'Department of Digital Media'),
 (12, 'S208', 'Sebastian', 'Martin', '2005-01-15', 'XT475070A', '93 Graham Rd., Chelsfield, BR68XD', 'Male', 'Scottish', 'SebastianMartin@dayrep.com', '07840685831', 'Active', 7, 'Department of Digital Media'),
 (13, 'S276', 'Itala', 'Marcelo', '1994-04-19', 'OS009671', '86 Farburn Terrace, Little Hougton, NN73YG', 'Female', 'Italian', 'ItalaMarcelo@teleworm.us', '07847640641', 'Active', 8, 'Department of Cloud Computing and DevOps'),
 (14, 'S236', 'Gabriele', 'Russo', '1996-06-08', 'BC703499A', '64 Warren St, West Grinstead, RH130NR', 'Male', 'Italian', 'GabrieleRusso@dayrep.com', '07722531308', 'Active', 9, 'Department of Robotics and Embedded Systems'),
 (15, 'S248', 'Emma', 'Williamson', '2005-12-18', 'EN303754', '67 Cambridge Road, Normanby, DN157AR', 'Female', 'Scottish', 'EmmaWilliamson@teleworm.us', '07880213151', 'Active', 9, 'Department of Robotics and Embedded Systems'),
 (16, 'S233', 'Crispina', 'Bellucci', '1990-09-21', 'JW779645A', '79 Hindhead Rd., Earlish, IV513TR', 'Female', 'Italian', 'CrispinaBellucci@teleworm.us', '07712701410', 'Active', 10, 'Department of Digital Forensics'),
 (17, 'S231', 'Kai', 'Black', '2001-09-26', 'KB054716', '21 Davids Lane, Stutton, IP94PH', 'Male', 'Scottish', 'KaiBlack@jourrapide.com', '07785272163', 'Active', 10, 'Department of Digital Forensics')]

In [56]:
%%sql

-- Let's create the ENROLLMENT table
DROP TABLE IF EXISTS ENROLLMENT;

CREATE TABLE ENROLLMENT(
  enrollment_id INTEGER PRIMARY KEY AUTOINCREMENT,
  student_id INTEGER NOT NULL,
  course_id INTEGER NOT NULL,
  enrollment_date DATE NOT NULL,
  academic_year VARCHAR(20) NOT NULL,
  semester VARCHAR(20) NOT NULL,
  final_grade VARCHAR(20),

  FOREIGN KEY(student_id) REFERENCES STUDENTS(student_id),
  FOREIGN KEY(course_id) REFERENCES COURSES(course_id)
);

-- Let's insert values in the ENROLLMENT table
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (1, 1, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (1, 2, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (1, 3, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (2, 1, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (2, 2, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (2, 3, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (3, 1, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (3, 2, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (3, 3, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (4, 1, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (4, 2, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (4, 3, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (9, 8, '2026-01-23', '2025/2026', 'First Semester', 'Distinction');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (9, 9, '2026-01-23', '2025/2026', 'First Semester', 'Good');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (9, 10, '2026-01-23', '2025/2026', 'First Semester', 'Failed');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (5, 17, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (5, 18, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (5, 19, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (5, 21, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (5, 20, '2026-01-23', '2025/2026', 'First Semester', 'Pending');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (6, 17, '2026-01-23', '2025/2026', 'First Semester', 'Distinction');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (6, 18, '2026-01-23', '2025/2026', 'First Semester', 'Distinction');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (6, 19, '2026-01-23', '2025/2026', 'First Semester', 'Distinction');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (6, 20, '2026-01-23', '2025/2026', 'First Semester', 'Distinction');
INSERT INTO ENROLLMENT (student_id, course_id, enrollment_date, academic_year, semester, final_grade) VALUES (6, 21, '2026-01-23', '2025/2026', 'First Semester', 'Distinction');

 * sqlite:///WU_Mock.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [57]:
%%sql

SELECT * FROM ENROLLMENT;

 * sqlite:///WU_Mock.db
Done.

[(1, 1, 1, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (2, 1, 2, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (3, 1, 3, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (4, 2, 1, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (5, 2, 2, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (6, 2, 3, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (7, 3, 1, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (8, 3, 2, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (9, 3, 3, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (10, 4, 1, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (11, 4, 2, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (12, 4, 3, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (13, 9, 8, '2026-01-23', '2025/2026', 'First Semester', 'Distinction'),
 (14, 9, 9, '2026-01-23', '2025/2026', 'First Semester', 'Good'),
 (15, 9, 10, '2026-01-23', '2025/2026', 'First Semester', 'Failed'),
 (16, 5, 17, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (17, 5, 18, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (18, 5, 19, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (19, 5, 21, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (20, 5, 20, '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 (21, 6, 17, '2026-01-23', '2025/2026', 'First Semester', 'Distinction'),
 (22, 6, 18, '2026-01-23', '2025/2026', 'First Semester', 'Distinction'),
 (23, 6, 19, '2026-01-23', '2025/2026', 'First Semester', 'Distinction'),
 (24, 6, 20, '2026-01-23', '2025/2026', 'First Semester', 'Distinction'),
 (25, 6, 21, '2026-01-23', '2025/2026', 'First Semester', 'Distinction')]

In [58]:
%%sql

-- Let's view the number of students in Department of Data Science and Big Data Analytic

SELECT
  s.student_no,
  s.first_name,
  s.last_name,
  d.dept_name,
  c.course_code,
  c.course_title,
  e.enrollment_date,
  e.academic_year,
  e.semester,
  e.final_grade
FROM STUDENTS s
JOIN DEPARTMENT d
  ON s.dept_id = d.dept_id
JOIN ENROLLMENT e
  ON s.student_id = e.student_id
JOIN COURSES c
  ON c.course_id = e.course_id
WHERE d.dept_name = 'Department of Data Science and Big Data Analytics';

 * sqlite:///WU_Mock.db
Done.

[('S230', 'Chidimma', 'Chukwuemeka', 'Department of Data Science and Big Data Analytics', 'COM736', 'Database Systems and Data Analytics', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S230', 'Chidimma', 'Chukwuemeka', 'Department of Data Science and Big Data Analytics', 'COM763', 'Advanced Machine Learning', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S230', 'Chidimma', 'Chukwuemeka', 'Department of Data Science and Big Data Analytics', 'COM762', 'Advanced Data Analysis and Visualisation', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S251', 'John .E.', 'Amayaa', 'Department of Data Science and Big Data Analytics', 'COM736', 'Database Systems and Data Analytics', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S251', 'John .E.', 'Amayaa', 'Department of Data Science and Big Data Analytics', 'COM763', 'Advanced Machine Learning', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S251', 'John .E.', 'Amayaa', 'Department of Data Science and Big Data Analytics', 'COM762', 'Advanced Data Analysis and Visualisation', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S260', 'Mathias', 'Fried', 'Department of Data Science and Big Data Analytics', 'COM736', 'Database Systems and Data Analytics', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S260', 'Mathias', 'Fried', 'Department of Data Science and Big Data Analytics', 'COM763', 'Advanced Machine Learning', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S260', 'Mathias', 'Fried', 'Department of Data Science and Big Data Analytics', 'COM762', 'Advanced Data Analysis and Visualisation', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S281', 'Brigitte', 'Faber', 'Department of Data Science and Big Data Analytics', 'COM736', 'Database Systems and Data Analytics', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S281', 'Brigitte', 'Faber', 'Department of Data Science and Big Data Analytics', 'COM763', 'Advanced Machine Learning', '2026-01-23', '2025/2026', 'First Semester', 'Pending'),
 ('S281', 'Brigitte', 'Faber', 'Department of Data Science and Big Data Analytics', 'COM762', 'Advanced Data Analysis and Visualisation', '2026-01-23', '2025/2026', 'First Semester', 'Pending')]